; domain
;; ============================================================
;; DOMAIN: rover-mineral-transport
;; ------------------------------------------------------------
;; Autor: Equipo Actividad 3 — Razonamiento y planificacion automatica
;; Curso: Maestria, Primer Semestre
;; Fecha: 2026-05-11
;;
;; Descripcion: Modelo de planificacion clasica para un robot tipo
;;   rover que debe trasladar minerales desde localidades de origen
;;   hasta uno o mas laboratorios para su analisis.
;;
;; Decisiones de modelado (ver docs/01-pddl-modeling-decisions.md):
;;   ADR-001: capacidad del rover = 1 mineral a la vez (forzamos
;;            replanificacion y planes mas ricos que carga ilimitada).
;;   ADR-002: funcion de costo = unitaria por accion (total-cost).
;;            Compatible con planners optimal track del IPC2018.
;;   ADR-003: aristas dirigidas representadas con predicado
;;            (path ?from ?to). Para bidireccionales se declaran
;;            dos atomos (uno por sentido) en el problem.pddl.
;;   ADR-004: "mal tiempo" no se modela como literal — el enunciado
;;            lo usa como motivo narrativo de por que el rover no
;;            puede trasladar todos los minerales de una vez; ya
;;            queda capturado por la capacidad = 1.
;; ============================================================

(define (domain rover-mineral-transport)

  (:requirements
    :typing
    :action-costs)

  ;; -------- Tipos --------
  (:types
    location  ;; nodos del grafo (L1, L2, ...)
    mineral   ;; rocas que el rover debe transportar
    rover     ;; el robot que se mueve
  )

  ;; -------- Predicados --------
  (:predicates
    ;; Posicion del rover
    (at ?r - rover ?l - location)

    ;; Conectividad del grafo (arista dirigida)
    (path ?from - location ?to - location)

    ;; Estado de los minerales
    (mineral-at ?m - mineral ?l - location)
    (carrying  ?r - rover    ?m - mineral)
    (analyzed  ?m - mineral)

    ;; Capacidad del rover (ADR-001): exclusion mutua "free / carrying"
    (free ?r - rover)

    ;; Marca de laboratorio (puede haber 1 o N en distintos problems)
    (lab-at ?l - location)
  )

  ;; -------- Funciones --------
  (:functions
    (total-cost) - number
  )

  ;; ============================================================
  ;; Acciones
  ;; ============================================================

  ;; Mover el rover por una arista existente del grafo.
  (:action move
    :parameters (?r - rover ?from - location ?to - location)
    :precondition (and
      (at ?r ?from)
      (path ?from ?to)
    )
    :effect (and
      (not (at ?r ?from))
      (at ?r ?to)
      (increase (total-cost) 1)
    )
  )

  ;; Recoger un mineral en la localidad actual.
  ;; Solo posible si el rover esta libre (capacidad = 1).
  (:action pickup
    :parameters (?r - rover ?m - mineral ?l - location)
    :precondition (and
      (at ?r ?l)
      (mineral-at ?m ?l)
      (free ?r)
    )
    :effect (and
      (carrying ?r ?m)
      (not (mineral-at ?m ?l))
      (not (free ?r))
      (increase (total-cost) 1)
    )
  )

  ;; Entregar el mineral en un laboratorio.
  ;; Tras la entrega, el mineral queda analizado y el rover libre.
  (:action deliver
    :parameters (?r - rover ?m - mineral ?l - location)
    :precondition (and
      (at ?r ?l)
      (lab-at ?l)
      (carrying ?r ?m)
    )
    :effect (and
      (analyzed ?m)
      (not (carrying ?r ?m))
      (free ?r)
      (increase (total-cost) 1)
    )
  )

)

; problem
;; ============================================================
;; PROBLEM 1: Rover base — escenario propuesto por el profesor
;; ------------------------------------------------------------
;; Enunciado: un rover excavo dos rocas (en L1 y L2). Debe llevar
;;   ambos minerales al laboratorio (L5) para su analisis.
;;
;; Topologia (Figura 1 del documento del profesor):
;;
;;       L1 <-> L3 -----> L2
;;              |          |
;;              v          v   (L2 -> L4 unidireccional)
;;             L4 <--------+
;;              |
;;              v   (L4 <-> L5 bidireccional)
;;             L5  (laboratorio)
;;
;; Aristas:
;;   L1 <-> L3   bidireccional
;;   L3  -> L2   unidireccional
;;   L2  -> L4   unidireccional
;;   L3 <-> L4   bidireccional
;;   L4 <-> L5   bidireccional
;;
;; Estado inicial: rover en L4 (posicion central en la Figura 1).
;; Goal: ambos minerales analizados en el laboratorio.
;; ============================================================

(define (problem rover-problem-1)
  (:domain rover-mineral-transport)

  (:objects
    L1 L2 L3 L4 L5 - location
    M1 M2          - mineral
    R1             - rover
  )

  (:init
    ;; Posicion inicial del rover
    (at R1 L4)
    (free R1)

    ;; Minerales en sus localidades de origen
    (mineral-at M1 L1)
    (mineral-at M2 L2)

    ;; Laboratorio
    (lab-at L5)

    ;; Topologia del grafo (aristas dirigidas; bidir = dos atomos)
    ;; L1 <-> L3
    (path L1 L3)
    (path L3 L1)

    ;; L3 -> L2 (unidireccional)
    (path L3 L2)

    ;; L2 -> L4 (unidireccional)
    (path L2 L4)

    ;; L3 <-> L4
    (path L3 L4)
    (path L4 L3)

    ;; L4 <-> L5
    (path L4 L5)
    (path L5 L4)

    ;; Coste acumulado inicia en 0
    (= (total-cost) 0)
  )

  (:goal (and
    (analyzed M1)
    (analyzed M2)
  ))

  (:metric minimize (total-cost))
)

; plan
1. (move r1 l4 l3)
   deleted: (at r1 l4)
   added: (at r1 l3)
   goals met: 0 of 2
2. (move r1 l3 l1)
   deleted: (at r1 l3)
   added: (at r1 l1)
   goals met: 0 of 2
3. (pickup r1 m1 l1)
   deleted: (mineral-at m1 l1) (free r1)
   added: (carrying r1 m1)
   goals met: 0 of 2
4. (move r1 l1 l3)
   deleted: (at r1 l1)
   added: (at r1 l3)
   goals met: 0 of 2
5. (move r1 l3 l4)
   deleted: (at r1 l3)
   added: (at r1 l4)
   goals met: 0 of 2
6. (move r1 l4 l5)
   deleted: (at r1 l4)
   added: (at r1 l5)
   goals met: 0 of 2
7. (deliver r1 m1 l5)
   deleted: (carrying r1 m1)
   added: (analyzed m1) (free r1)
   goals met: 1 of 2
8. (move r1 l5 l4)
   deleted: (at r1 l5)
   added: (at r1 l4)
   goals met: 1 of 2
9. (move r1 l4 l3)
   deleted: (at r1 l4)
   added: (at r1 l3)
   goals met: 1 of 2
10. (move r1 l3 l2)
   deleted: (at r1 l3)
   added: (at r1 l2)
   goals met: 1 of 2
11. (pickup r1 m2 l2)
   deleted: (mineral-at m2 l2) (free r1)
   added: (carrying r1 m2)
   goals met: 1 of 2
12. (move r1 l2 l4)
   deleted: (at r1 l2)
   added: (at r1 l4)
   goals met: 1 of 2
13. (move r1 l4 l5)
   deleted: (at r1 l4)
   added: (at r1 l5)
   goals met: 1 of 2
14. (deliver r1 m2 l5)
   deleted: (carrying r1 m2)
   added: (analyzed m2) (free r1)
   goals met: 2 of 2
